tap 'homebrew/core'

tap 'homebrew/bundle' # gives basic brewfile capability needed by provision-mac.sh

tap 'rcmdnk/file'     # a few other features for alternate brew file management
brew 'brew-file'      # but it has to be set up/initiated if desired
                      # https://homebrew-file.readthedocs.io/en/latest/

# shells and standard command line utilities
brew 'zsh'
brew 'fish'
brew 'bash'
brew 'bash-completion'
brew 'coreutils'
brew 'findutils'
brew 'grep'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'readline'
brew 'tree'
brew 'htop'
brew 'p7zip'
brew 'lbzip2'
brew 'lz4'
brew 'unar'
brew 'gnupg'
brew 'xz'
brew 'tldr'
brew 'zlib'
brew 'thefuck'
brew 'pv'
brew 'fzf'

# meta environments
brew 'python' # brew version is backup
brew 'rbenv'
brew 'ruby-build'
brew 'nodenv'
brew 'node-build'
# brew 'rustup-init' # installed in provision-mac.sh

# other programming languages
brew 'go'
brew 'r'
brew 'lua'
brew 'perl'

# network stuff
brew 'wget'
brew 'nmap'
brew 'tor'
brew 'elinks'
brew 'iperf3'
brew 'openssl'
brew 'openconnect'
brew 'wifi-password'
brew 'speedtest-cli'

# dev tools
brew 'neovim'
brew 'git'
brew 'git-lfs'
brew 'bfg'
brew 'mercurial'
brew 'cmake'
brew 'clang-format'
brew 'ctags'
brew 'hub'
brew 'gh'
brew 'libgit2' # r devtools dep
brew 'libyaml'
brew 'ripgrep'
brew 'jq'
brew 'sqlite'
brew 'mycli'
brew 'podman'
brew 'doctl'

# document and graphics tools
brew 'emacs'
brew 'pandoc'
brew 'multimarkdown'
brew 'sphinx-doc'
brew 'xmlto'
brew 'imagemagick'
brew 'ghostscript'
brew 'pdf2svg'
brew 'svg2png'
brew 'woff2'
brew 'pngcrush'
brew 'pngquant'
brew 'zopfli'
brew 'guetzli'
brew 'mozjpeg'
brew 'gifski'
brew 'openjpeg'
brew 'webp'

# various and sundry
brew 'hugo'
brew 'lame'
brew 'mpv'
brew 'libdvdcss'
brew 'youtube-dl'
brew 'ffmpeg'
brew 'libav'
brew 'dockutil'
brew 'defaultbrowser'
brew 'trash'
brew 'pidof'
brew 'fdupes'
brew 'weechat'

# amusements!
brew 'nethack'
brew 'frotz'
brew 'solarus'

# now getting into full macOS apps
tap 'homebrew/cask-versions'
cask 'affinity-publisher-beta' # license
cask 'firefox-developer-edition'

tap 'homebrew/cask'

# dependencies to be installed first
cask 'adoptopenjdk' #imagej dependency
cask 'xquartz' # wine-stable dependency

# now cask apps
cask '1password' # license
cask 'adium'
cask 'adventure'
cask 'alfred' # license
cask 'anki'
cask 'applepi-baker'
cask 'arduino'
cask 'audio-hijack' # license
cask 'authy'
cask 'autodesk-fusion360' # education license
# cask 'backblaze' # don't use homebrew for this; upgrade will bork things
cask 'balenaetcher'
# cask 'bartender' # install/use setapp version
cask 'basictex'
cask 'bbedit' # license
cask 'bettertouchtool' # license
cask 'calibre'
cask 'carbon-copy-cloner' # license
cask 'cheatsheet'
# cask 'cleanmymac' # use setapp version
cask 'crunch'
cask 'cyberduck'
# cask 'default-folder-x' # license
                          # use setapp version
cask 'devonthink' # license
cask 'dhs'
cask 'discord'
cask 'docker'
cask 'do-not-disturb'
cask 'epic-games'
cask 'etrecheckpro'
cask 'fing'
cask 'firefox'
cask 'fission' # license
cask 'fluid'
cask 'flux'
cask 'fontforge'
cask 'gog-galaxy'
cask 'google-chrome'
cask 'google-drive'
cask 'hazel'
cask 'hook' # license
cask 'iina'
cask 'imagej'
cask 'imageoptim'
cask 'imazing' # license
cask 'insomnia'
cask 'istat-menus' # license
cask 'itch'
# cask 'ivpn' # cask has loading issues, use direct
cask 'julia'
cask 'kaleidoscope' # license
cask 'kextviewr'
cask 'keyboard-maestro' # license
cask 'kindle'
cask 'knockknock'
cask 'little-snitch' # license
cask 'macupdater'
cask 'maestral'
cask 'marked' # license
cask 'microsoft-office' # license
cask 'microsoft-teams' # license
cask 'nvalt'
cask 'obsidian'
cask 'omnidisksweeper'
cask 'onyx'
cask 'openemu'
cask 'oversight' # CAVEAT: need to quit oversight from menu bar or else brew hangs
cask 'pacifist'
cask 'pdf-expert' # license
cask 'pdfpenpro'
cask 'pingplotter'
cask 'podcastmenu'
cask 'post-haste'
cask 'quitter'
cask 'r' # seem to be cran issues if I just brew the cli
cask 'resilio-sync'
cask 'rstudio'
cask 'screens' # license
cask 'scrivener' # license
cask 'send-to-kindle'
# cask 'setapp' # cask has issues, use direct app
cask 'signal'
cask 'silentknight'
cask 'skim'
cask 'skype'
cask 'soundsource' # license
cask 'swiftdefaultappsprefpane'
cask 'steam'
cask 'sublime-text'
cask 'synergy' # license/account
cask 'taskexplorer'
cask 'temurin'
cask 'textexpander'
cask 'tor-browser'
cask 'tower' # edu license
cask 'transmission'
cask 'unclack'
cask 'virtualbox'
cask 'visual-studio'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'wine-stable'
cask 'wwdc'
cask 'xscope'
cask 'zerobranestudio'
cask 'zoom'
cask 'zotero'

# swiftbar - https://github.com/swiftbar/SwiftBar
tap 'melonamin/formulae'
cask 'swiftbar'

# quicklook stuff - https://github.com/markcarroll/quick-look-plugins
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'suspicious-package'

# a few monospaced fonts from caskroom
#   (others handled outside of script)
tap  'homebrew/cask-fonts'
cask 'font-academicons'
cask 'font-anonymous-pro'
cask 'font-atkinson-hyperlegible'
cask 'font-dejavu'                  # ar
cask 'font-fira-code'
cask 'font-hack'
cask 'font-inconsolata'
cask 'font-jomhuria'                # ar/en display
cask 'font-juliamono'
cask 'font-katibeh'                 # ar/en
cask 'font-national-park'
cask 'font-noto-sans-arabic'        # ar
cask 'font-scheherazade'            # ar

# sjml (upstream author) apps
tap  'sjml/sjml'
cask 'dotfile-watcher'

# drivers
tap  'homebrew/cask-drivers'
cask 'sonos'
cask 'ubiquiti-unifi-controller'
cask 'luna-display'
cask 'luna-secondary'
cask '8bitdo-firmware-updater'
cask 'caldigit-thunderbolt-charging'
cask 'displaylink'
cask 'logitech-options'


# and finally, stuff from the Mac App Store
brew 'mas'

mas 'ActiveTab', id: 1588852241
mas 'Affinity Designer', id: 824171161
mas 'Affinity Photo', id: 824183456
mas 'Airmail', id: 918858936
mas 'Amphetamine', id: 937984704
mas 'BetterSnapTool', id: 417375580
mas 'Broadcasts', id: 1469995354
mas 'Cardhop', id: 1290358394
mas 'CARROT Weather', id: 993487541
mas 'Clean Text', id: 414782261
mas 'Craft', id: 1487937127
mas 'Deliveries', id: 290986013
mas 'Drafts', id: 1435957248
mas 'Fantastical', id: 975937182
mas 'Front and Center', id: 1493996622
mas 'FruitJuice', id: 671736912
# mas 'GarageBand', id: 682658836 # these updates are tough on my net
mas 'Gemini 2', id: 1090488118
mas 'HazeOver', id: 430798174
mas 'iMovie', id: 408981434
mas 'iPulse', id: 1028916583
mas 'KeyKey', id: 1035137927
mas 'Keynote', id: 409183694
mas 'Mactracker', id: 430255202
mas 'Magnet', id: 441258766
mas 'Mela', id: 1568924476
mas 'Morpho', id: 1494942612
mas 'Numbers', id: 409203825
# mas 'OneDrive', id: 823766827 # installed by office cask
mas 'Pages', id: 409201541
mas 'Pastebot', id: 1179623856
mas 'PCalc', id: 403504866
mas 'Peek', id: 1554235898
mas 'PiPifier', id: 1160374471
mas 'Pocket', id: 568494494
mas 'PopClip', id: 445189367
mas 'Slack', id: 803453959
mas 'SwitchGlass', id: 1498546559
mas 'The Unarchiver', id: 425424353
mas 'uBlock', id: 1385985095
mas 'Unclutter', id: 577085396
mas 'Wallpaper Wizard', id: 1266674560
mas 'Xcode', id: 497799835
# mas 'Zen Timer', id: 1031035430 # gone from store rip


## Other apps to remember (not managed by brew, MAS, Setapp)

# Setapp
# Twitterific (non-MAS Project Phoenix version) # copy from /Applications
                                                # license
# News Explorer                                 # license
# CalHash
# Consolation3
# BlockBlock Helper
# iVPN                                          # license
# Displays (Jibapps)                            # license
# Interact Scratchpad
# Oracle Java 8                                 # Ubiquiti requires JRE 8 and expects Oracle Java
                                                # https://www.java.com/en/download/
