tap 'rcmdnk/file'     # a few other features for alternate brew file management
brew 'rcmdnk/file/brew-file'      # but it has to be set up/initiated if desired
                      # https://homebrew-file.readthedocs.io/en/latest/

# shells and standard command line utilities
brew 'fish'
brew 'zsh'
brew 'bash'
brew 'bash-completion'
brew 'coreutils'
brew 'parallel'
brew 'pv'
brew 'direnv'
brew 'tree'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'readline'
brew 'htop'
brew 'eza'
brew 'thefuck'
brew 'tldr'

# compression stuffs
brew 'zlib'
brew 'p7zip'
brew 'lbzip2'
brew 'lz4'
brew 'unar'
brew 'gnupg'
brew 'xz'
brew 'brotli'
brew 'pigz'



# programming languages
# brew 'asdf' # falling back to brew for now

## main
brew 'uv' # for Python
brew 'python'
brew 'node'
brew 'deno'
brew 'rustup-init'
brew 'go'
brew 'zig'
brew 'r'
brew 'lua'
brew 'ruby'
brew 'php' # look, i'm not proud of it, but

## don't really use, but needed for other things
brew 'openjdk'

## other programming languages
brew 'erlang'
brew 'elixir'
brew 'elm'
brew 'ghc'
brew 'cabal-install'
brew 'haskell-stack'
brew 'perl'

# network stuff
brew 'wget'
brew 'aria2'
brew 'nmap'
brew 'tcptraceroute'
brew 'tor'
brew 'felinks'
brew 'iperf3'
brew 'openssl'
brew 'openconnect'
brew 'wifi-password'
brew 'xxhash'
brew 'speedtest-cli'

# dev tools
## text editors
brew 'vim'
brew 'neovim'
brew 'nano'
brew 'emacs'
brew 'micro'

## source control
brew 'git'
brew 'git-lfs'
brew 'git-filter-repo'
brew 'hub'
brew 'gh'
brew 'bfg'
brew 'mercurial'
brew 'subversion'
brew 'fossil'
brew 'libgit2' # r devtools dep

## build systems and tools
brew 'cmake'
brew 'scons'
brew 'meson'
brew 'ninja'
brew 'automake'
brew 'mingw-w64'
brew 'emscripten'
brew 'clang-format'
brew 'swiftformat'
brew 'swift-format'
brew 'cocoapods'
brew 'stylua'
brew 'swig'
brew 'ctags'
brew 'qcachegrind'
brew 'yasm'
brew 'flatbuffers'
brew 'cloc'

## virtualization
brew 'qemu'
brew 'podman'
brew 'docker'
brew 'colima'

## search and store
brew 'findutils'
brew 'fzf'
brew 'grep'
brew 'ripgrep'
brew 'jq'
brew 'yq'
brew 'sqlite'
brew 'sqlite-utils'
brew 'testdisk'

# document and graphics tools
brew 'pandoc'
brew 'multimarkdown'
brew 'sphinx-doc'
brew 'xmlto'
brew 'imagemagick'
brew 'ghostscript'
brew 'pdf2svg'
brew 'svg2png'
brew 'librsvg'
brew 'woff2'
brew 'pngcrush'
brew 'pngquant'
brew 'jpegoptim'
brew 'zopfli'
brew 'guetzli'
brew 'mozjpeg'
brew 'gifski'
brew 'openjpeg'
brew 'webp'
brew 'gifsicle'
brew 'svgo'

# various and sundry
brew 'brightness'
brew 'ocrmypdf'
brew 'lame'
brew 'mpv'
brew 'libdvdcss'
brew 'yt-dlp'
brew 'gallery-dl'
brew 'ffmpeg'
brew 'dockutil'
brew 'defaultbrowser'
brew 'duti'
brew 'trash'
brew 'pidof'
brew 'entr'
brew 'molten-vk'
brew 'm1ddc'
brew 'hyperfine'
brew 'synergy-core' # license/account

# amusements!
brew 'nethack'
brew 'frotz'
brew 'solarus'

# now getting into full macOS apps

# infrastructure
cask '1password' #license
cask '1password-cli'
# cask 'backblaze' # don't use homebrew for this; upgrade will bork things
cask 'backblaze-downloader'
cask 'little-snitch' #license

# dependencies to be installed first
cask 'xquartz' # wine-stable dependency

# now cask apps
cask 'adium'
cask 'adobe-digital-editions'
cask 'affinity-designer' # license
cask 'affinity-photo' # license
cask 'affinity-publisher' # license
cask 'alfred' # license
cask 'anki'
cask 'applepi-baker'
cask 'arduino-ide'
cask 'audio-hijack' # license
cask 'autodesk-fusion360' # education license
# cask 'backblaze' # don't use homebrew for this; upgrade will bork things
cask 'balenaetcher'
cask 'basictex'
cask 'bbedit' # license
cask 'bettertouchtool' # license
cask 'bunch'
cask 'calibre'
cask 'carbon-copy-cloner' # license
cask 'crunch'
cask 'cyberduck'
cask 'devonagent' # license
cask 'devonthink' # license
cask 'dhs'
cask 'discord'
cask 'epic-games'
cask 'etrecheckpro'
cask 'fing'
cask 'firefox'
cask 'firefox@developer-edition'
cask 'fission' # license
cask 'fluid'
cask 'flux'
cask 'fontforge'
cask 'freecad'
cask 'gog-galaxy'
cask 'google-chrome'
cask 'google-drive'
cask 'hazel'
cask 'iina'
cask 'imagej'
cask 'imageoptim'
cask 'imazing' # license
cask 'insomnia'
cask 'itch'
cask 'julia'
cask 'kaleidoscope' # license
cask 'kextviewr'
cask 'keyboard-maestro' # license
cask 'knockknock'
cask 'logi-options+'
cask 'macs-fan-control'
cask 'macupdater'
cask 'maestral'
cask 'marked' # license
cask 'microsoft-office' # license
cask 'microsoft-teams' # license
cask 'mountain' # license
cask 'nvalt'
cask 'obsidian'
cask 'omnidisksweeper'
cask 'onyx'
cask 'openemu'
cask 'oversight' # CAVEAT: need to quit oversight from menu bar or else brew hangs
cask 'moom'
cask 'pacifist'
cask 'pdf-expert' # license
cask 'pingplotter'
cask 'plex-media-server'
cask 'podcastmenu'
cask 'post-haste'
cask 'quitter'
cask 'r' # seem to be cran issues if I just brew the cli
cask 'resilio-sync'
cask 'rstudio'
cask 'screens' # license
cask 'scrivener' # license
cask 'send-to-kindle'
# cask 'setapp' # cask has issues, use direct app
cask 'sf-symbols'
cask 'signal'
cask 'silentknight'
cask 'skim'
cask 'skype'
cask 'sloth'
cask 'soundsource' # license
cask 'steam'
cask 'sublime-text'
cask 'swiftdefaultappsprefpane'
cask 'taskexplorer'
cask 'temurin'
cask 'textexpander'
cask 'tor-browser'
cask 'tower' # edu license
cask 'transmission'
cask 'unclack'
# cask 'virtualbox' # no arm support
cask 'visual-studio'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'whisky'
cask 'wine-stable'
cask 'wwdc'
cask 'xscope'
cask 'zerobranestudio'
cask 'zoom'
cask 'zotero'

# swiftbar - https://github.com/swiftbar/SwiftBar
tap 'melonamin/formulae'
cask 'melonamin/formulae/swiftbar'

# quicklook stuff - https://github.com/markcarroll/quick-look-plugins
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'suspicious-package'
cask 'qlcolorcode'
cask 'qlvideo'
cask 'apparency'


# a few monospaced fonts from caskroom
#   (others handled outside of script)
cask 'font-academicons'
cask 'font-anonymous-pro'
cask 'font-atkinson-hyperlegible'
cask 'font-dejavu'                  # ar
cask 'font-fira-code'
cask 'font-hack'
cask 'font-inconsolata'
cask 'font-jomhuria'                # ar/en display
cask 'font-juliamono'
cask 'font-katibeh'                 # ar/en
cask 'font-national-park'
cask 'font-noto-sans-arabic'        # ar
cask 'font-scheherazade'            # ar

# SJML (upstream author) tools
# https://github.com/sjml
tap  'sjml/sjml'
brew 'sjml/sjml/beschi'
brew 'sjml/sjml/paper'
brew 'sjml/sjml/secure-pbcopy'
cask 'sjml/sjml/dotfile-watcher'

# drivers
cask 'sonos'
cask 'ubiquiti-unifi-controller'
cask '8bitdo-ultimate-software'
cask 'caldigit-thunderbolt-charging'
cask 'displaylink'


# and finally, stuff from the Mac App Store
brew 'mas'

mas 'AdBlock Pro', id: 1018301773
mas 'Airmail', id: 918858936
mas 'Amphetamine', id: 937984704
mas 'BetterSnapTool', id: 417375580
mas 'Broadcasts', id: 1469995354
mas 'Cardhop', id: 1290358394
mas 'CARROT Weather', id: 993487541
mas 'Clean Text', id: 414782261
mas 'Craft', id: 1487937127
mas 'Drafts', id: 1435957248
mas 'Fantastical', id: 975937182
mas 'Front and Center', id: 1493996622
mas 'GarageBand', id: 682658836
mas 'Gemini 2', id: 1090488118
mas 'HazeOver', id: 430798174
mas 'iMovie', id: 408981434
mas 'iPulse', id: 1028916583
mas 'KeyKey', id: 1035137927
mas 'Keynote', id: 409183694
mas 'LosslessCut', id: 1505323402
mas 'Mactracker', id: 430255202
mas 'Magnet', id: 441258766
mas 'Mela', id: 1568924476
mas 'Monodraw', id: 920404675
mas 'Morpho', id: 1494942612
mas 'Numbers', id: 409203825
# mas 'OneDrive', id: 823766827 # installed by office cask
mas 'Overcast', id: 888422857
mas 'Pages', id: 409201541
mas 'Parcel', id: 639968404
mas 'Pastebot', id: 1179623856
mas 'PCalc', id: 403504866
mas 'Peek', id: 1554235898
mas 'PiPifier', id: 1160374471
mas 'Slack', id: 803453959
mas 'SwitchGlass', id: 1498546559
mas 'Tailscale', id: 1475387142
mas 'The Unarchiver', id: 425424353
mas 'uBlock', id: 1385985095
mas 'Unclutter', id: 577085396
mas 'Wallpaper Wizard', id: 1266674560
mas 'Xcode', id: 497799835


## Other apps to remember (not managed by brew, MAS, Setapp)

# Setapp

# BlockBlock Helper
# CalHash
# Cleanup Buddy
# Consolation3
# Displays (Jibapps)                            # license
# Interact Scratchpad                           # https://docs.getdrafts.com/docs/misc/interact-scratchpad#download-the-interact-scratchpad
# IVPN                                          # license
# News Explorer                                 # license
# Oracle Java 8                                 # Ubiquiti requires JRE 8 and expects Oracle Java
                                                # https://www.java.com/en/download/
# Synergy (v3)                                  # https://symless.com/synergy/
                                                # license
# TrackerZapper                                 # https://github.com/rknightuk/TrackerZapper

# Gather (URLs to Markdown)
# https://brettterpstra.com/projects/gather-cli/
# Requires full Xcode
# tap 'ttscoff/thelab'
# brew 'ttscoff/thelab/gather-cli'
